# Ввод и вывод текста в Python
**Предмет:** Технологии программирования
**Специальность:** Компьютерная лингвистика

**Теоретическая часть**

### 1. Базовый вывод: функция `print()`
```python
# Простой вывод строки
print("Привет, мир!")

# Вывод нескольких аргументов
print("Текст 1", "Текст 2", "Текст 3")

# Специальные параметры:
# sep - разделитель между аргументами (по умолчанию пробел)
# end - что добавлять в конце (по умолчанию перенос строки)
print("Python", "лингвистика", sep=" | ", end="!\n")

# Форматированный вывод
text = "обработка текста"
print(f"Это пример {text} в Python") 
```
## 2. Ввод данных: функция input()
```python
# Базовый ввод
name = input("Введите ваше имя: ")

# Тип данных input() - всегда строка
age = input("Введите ваш возраст: ")
print(type(age))  # <class 'str'>

# Преобразование в нужный тип
age_int = int(age)  # Для числовых данных
```
## 3. Работа с файлами (текстовыми)
```python
# Запись в файл
with open('текст.txt', 'w', encoding='utf-8') as file:
    file.write("Пример текста\n")
    file.write("Вторая строка\n")

# Дозапись в файл
with open('текст.txt', 'a', encoding='utf-8') as file:
    file.write("Дополнительная строка\n")

# Чтение из файла
with open('текст.txt', 'r', encoding='utf-8') as file:
    content = file.read()  # Чтение всего файла
    # или
    lines = file.readlines()  # Чтение по строкам

# Построчное чтение
with open('текст.txt', 'r', encoding='utf-8') as file:
    for line in file:
        print(line.strip())  # strip() убирает переносы строк
```
## 4. Кодировки символов (важно для лингвистики!)
```python
# Разные кодировки для разных языков
text_ru = "Привет, мир!"  # UTF-8 (стандарт в Python 3)
text_en = "Hello, world!"

# Явное указание кодировки при работе с файлами
with open('file.txt', 'w', encoding='utf-8') as f:
    f.write("Текст на русском")

# Альтернативные кодировки
# cp1251 - для Windows-систем
# koi8-r - для старых русских систем
```
## 5. Потоки ввода-вывода: sys.stdin и sys.stdout
```python
import sys

# Использование стандартных потоков
sys.stdout.write("Вывод через stdout\n")
data = sys.stdin.readline().strip()
```
## Практические упражнения
## Упражнение 1: Базовый диалог
Создайте программу, которая:
1. Запрашивает имя пользователя
2. Запрашивает любимый язык программирования
3. Выводит персональное сообщение

```python
# Пример решения
name = input("Как вас зовут? ")
lang = input("Ваш любимый язык программирования? ")
print(f"Привет, {name}! {lang} - отличный выбор для лингвиста!")
```
## Упражнение 2: Анализ текста
Напишите программу, которая:
1. Принимает от пользователя текст
2. Считает количество символов (с пробелами и без)
3. Считает количество слов
```python
text = input("Введите текст для анализа: ")
print(f"Символов (с пробелами): {len(text)}")
print(f"Символов (без пробелов): {len(text.replace(' ', ''))}")
print(f"Слов: {len(text.split())}")
```
## Упражнение 3: Работа с файлами
Создайте программу для ведения лингвистического дневника:
```python
# Запись лингвистических наблюдений
date = input("Введите дату (ДД.ММ.ГГГГ): ")
observation = input("Опишите ваше лингвистическое наблюдение: ")

with open('linguistic_diary.txt', 'a', encoding='utf-8') as diary:
    diary.write(f"\nДата: {date}\n")
    diary.write(f"Наблюдение: {observation}\n")
    diary.write("-" * 40)

print("Запись сохранена в файл 'linguistic_diary.txt'")
```
## Упражнение 4: Конвертер текста
Напишите программу, которая:
1. Читает текст из файла input.txt
2. Приводит его к верхнему регистру
3. Сохраняет результат в output.txt
4. Выводит статистику по файлу
## Упражнение 5: Поиск лингвистических паттернов
```python
# Поиск определенных слов в тексте
text = input("Введите текст для анализа: ").lower()
search_word = input("Какое слово ищем? ").lower()

words = text.split()
count = words.count(search_word)

print(f"Слово '{search_word}' встречается {count} раз(а)")

# Дополнительно: найти все слова, начинающиеся на определенную букву
letter = input("Введите букву для поиска слов: ").lower()
words_with_letter = [word for word in words if word.startswith(letter)]
print(f"Слова на букву '{letter}': {words_with_letter}")
```
## Контрольные вопросы
### Вопросы для самопроверки:
1. Чем отличается print("a", "b") от print("a" + "b")?
2. Почему при чтении числовых данных через input() нужно использовать преобразование типов?
3. Какая кодировка используется в Python 3 по умолчанию и почему она важна для компьютерной лингвистики?
4. В чем разница между режимами 'w', 'a', 'r' при открытии файлов?
5. Как предотвратить потерю данных при работе с файлами, если программа аварийно завершится?
6. Что делает метод .strip() и когда его стоит применять?
7. Как организовать чтение очень большого текстового файла, не загружая его полностью в память?
8. Какие есть способы форматирования строк в Python? Приведите примеры каждого.
9. Как обработать ситуацию, когда пользователь вводит пустую строку?
10. Почему для лингвистических задач часто предпочитают использовать кодировку UTF-8?

## Практические задачи:
1. **Задача:** Напишите программу, которая читает файл с текстом на русском языке и создает новый файл, где все предложения начинаются с заглавной буквы.
2. **Задача:** Создайте "анкету лингвиста", которая запрашивает:
   * ФИО
   * Направление исследований (синтаксис, семантика, морфология и т.д.)
   * Любимый языковой корпус
   * Сохраняет данные в структурированном виде в файл
3. **Задача:** Напишите программу, которая принимает путь к текстовому файлу и выводит:
   * 10 самых частых слов
   * Среднюю длину слова
   * Количество уникальных слов
## Дополнительные материалы для компьютерных лингвистов
### Рекомендуемые библиотеки:
```python
# Для работы с текстом в лингвистике
import codecs  # для работы с разными кодировками
import io  # для работы с потоками ввода-вывода
import chardet  # для определения кодировки текста

# Пример определения кодировки
with open('unknown.txt', 'rb') as f:
    result = chardet.detect(f.read())
    encoding = result['encoding']
```
## Особенности для лингвистических данных:
1. Многоязычные тексты: Всегда указывайте кодировку явно
2. Большие корпуса: Используйте построчную обработку
3. Специальные символы: Будьте внимательны с пунктуацией и диакритическими знаками
## Паттерны обработки текста:
```python
# Чтение больших файлов по частям
def process_large_file(filename, chunk_size=1024):
    with open(filename, 'r', encoding='utf-8') as f:
        while True:
            chunk = f.read(chunk_size)
            if not chunk:
                break
            # обработка чанка
            yield chunk

# Работа с CSV/TSV файлами (распространены в лингвистике)
import csv
with open('corpus.tsv', 'r', encoding='utf-8') as tsvfile:
    reader = csv.reader(tsvfile, delimiter='\t')
    for row in reader:
        print(row)
```
_Для успешного освоения темы рекомендуется выполнить все практические упражнения и ответить на контрольные вопросы. Особое внимание уделяйте работе с кодировками и обработке больших текстовых данных, что критически важно для компьютерной лингвистики._