# Практический урок №10
## Создание функций и их применение к тексту
**Предмет:** Технологии программирования  
**Специальность:** Компьютерная лингвистика  

## Цель урока

Научиться создавать собственные функции на языке Python и применять их для обработки текстовых данных.

## Теоретическая часть

### Что такое функция?

**Функция** — это именованный блок кода, который выполняет определённую задачу и может быть вызван многократно в любом месте программы.

Использование функций даёт несколько преимуществ: код становится структурированным и читаемым, одну и ту же логику не нужно повторять, ошибку достаточно исправить в одном месте, а функции легко переиспользовать в других проектах.

### Синтаксис функции в Python

```python
def имя_функции(параметр1, параметр2):
    """Описание функции (необязательно, но рекомендуется)"""
    # тело функции
    return результат
```

**Ключевые элементы:**

| Элемент     | Описание                                     | Пример                |
|-------------|----------------------------------------------|-----------------------|
| `def`       | Ключевое слово для объявления функции        | `def say_hello():`    |
| Имя функции | Название, по которому вызывается функция     | `count_words`         |
| Параметры   | Входные данные функции (могут отсутствовать) | `(text, symbol)`      |
| `return`    | Возвращает результат (необязательно)         | `return result`       |
| Docstring   | Строка описания функции                      | `"""Считает слова"""` |

### Виды функций

**1. Функция без параметров и возвращаемого значения**
```python
def print_greeting():
    print("Привет, лингвист!")

print_greeting()  # Привет, лингвист!
```

**2. Функция с параметрами**
```python
def greet_user(name):
    print(f"Привет, {name}!")

greet_user("Анна")  # Привет, Анна!
```

**3. Функция с возвращаемым значением**
```python
def count_chars(text):
    return len(text)

result = count_chars("Привет мир")
print(result)  # 10
```

**4. Функция с параметром по умолчанию**
```python
def repeat_word(word, times=2):
    return (word + " ") * times

print(repeat_word("эхо"))       # эхо эхо 
print(repeat_word("эхо", 3))    # эхо эхо эхо 
```

### Применение функций к тексту

Функции особенно полезны при обработке текста в компьютерной лингвистике. С их помощью можно подсчитывать слова и символы, очищать текст, находить части речи, анализировать частотность и многое другое.

```python
text = "Компьютерная лингвистика — увлекательная наука"

def to_uppercase(text):
    return text.upper()

def count_words(text):
    words = text.split()
    return len(words)

print(to_uppercase(text))   # КОМПЬЮТЕРНАЯ ЛИНГВИСТИКА — УВЛЕКАТЕЛЬНАЯ НАУКА
print(count_words(text))    # 4
```

## Практические задания

### Задание 1. Первая функция для текста

Изучите пример и запустите код.

```python
def get_first_word(text):
    """Возвращает первое слово из текста."""
    words = text.split()
    if words:
        return words[0]
    return ""

sentence = "Лингвистика изучает язык"
print(get_first_word(sentence))  # Лингвистика
```

**Что сделать:**
1. Запустите код и убедитесь, что он работает.
2. Напишите функцию `get_last_word(text)`, которая возвращает **последнее** слово из текста.
3. Проверьте функцию на строке `"Я изучаю Python"`.

### Задание 2. Подсчёт символов и слов

```python
def text_stats(text):
    """Возвращает количество символов и слов в тексте."""
    char_count = len(text)
    word_count = len(text.split())
    return char_count, word_count

sample = "Обработка текста на Python очень удобна"
chars, words = text_stats(sample)
print(f"Символов: {chars}, Слов: {words}")
```

**Что сделать:**
1. Запустите код и посмотрите на вывод.
2. Добавьте в функцию подсчёт **количества предложений** (считайте, что предложение заканчивается точкой `.`).
3. Протестируйте на тексте: `"Я учусь программировать. Это интересно. Python — мой язык."`.

### Задание 3. Очистка и преобразование текста

```python
def clean_text(text):
    """Убирает лишние пробелы и приводит текст к нижнему регистру."""
    text = text.strip()          # убрать пробелы по краям
    text = text.lower()          # нижний регистр
    return text

dirty_text = "   ПРИВЕТ МИР   "
print(clean_text(dirty_text))   # привет мир
```

**Что сделать:**
1. Запустите и проверьте результат.
2. Напишите функцию `normalize_text(text)`, которая:
   - убирает лишние пробелы по краям,
   - приводит к нижнему регистру,
   - заменяет несколько пробелов подряд на один (используйте метод `.split()` и `" ".join()`).
3. Проверьте на строке `"  ОЧЕНЬ    МНОГО    ПРОБЕЛОВ  "`.

### Задание 4. Поиск слов в тексте

```python
def find_long_words(text, min_length=6):
    """Возвращает список слов длиннее min_length символов."""
    words = text.split()
    long_words = []
    for word in words:
        if len(word) >= min_length:
            long_words.append(word)
    return long_words

paragraph = "Лингвистика изучает структуру и развитие языка"
print(find_long_words(paragraph))
# ['Лингвистика', 'изучает', 'структуру', 'развитие']
```

**Что сделать:**
1. Запустите код.
2. Измените вызов функции так, чтобы находились слова длиннее **8** символов.
3. Напишите аналогичную функцию `find_short_words(text, max_length=3)`, которая возвращает слова **не длиннее** `max_length` символов.

### Задание 5. Самостоятельная работа

Напишите функцию `analyze_text(text)`, которая принимает строку с текстом и выводит следующие данные:

- Количество слов
- Количество символов (без пробелов)
- Самое длинное слово
- Количество уникальных слов

**Пример вывода:**
```
=== Анализ текста ===
Слов: 6
Символов (без пробелов): 38
Самое длинное слово: лингвистика
Уникальных слов: 6
```

Протестируйте функцию на тексте:

```python
text = "наука лингвистика изучает язык и лингвистику"
analyze_text(text)
```

**Подсказки:**
- Для подсчёта символов без пробелов используйте `text.replace(" ", "")`.
- Для нахождения самого длинного слова — функцию `max()` с параметром `key=len`.
- Для уникальных слов — структуру данных `set()`.

## Вопросы для самопроверки

1. Что такое функция в программировании и зачем она нужна?
2. Какое ключевое слово используется для объявления функции в Python?
3. Чем отличается **параметр** функции от **аргумента**?
4. Что делает инструкция `return`? Что происходит, если её не указать?
5. Что такое параметр по умолчанию? Приведите пример.
6. Можно ли вызвать функцию до её объявления в коде? Почему?
7. Что такое `docstring` и зачем его писать?
8. Какой результат вернёт следующий код?
   ```python
   def double(word):
       return word * 2
   
   print(double("ха"))
   ```
9. Как передать в функцию несколько аргументов?
10. Почему использование функций делает код лучше, чем многократное копирование одного и того же блока?