# Практическая работа №3

**Тема:** Практические упражнения с символами и строками  
**Предмет:** Технологии программирования  
**Специальность:** Компьютерная лингвистика  
**Сложность:** Средняя  

---

## Цели работы

- Закрепить навыки работы с символами и строками в программировании.
- Научиться применять встроенные методы строк для обработки текста.
- Развить практические навыки, актуальные для задач компьютерной лингвистики.

---

## Теоретические сведения

### Строки и символы

**Строка** — это последовательность символов. В большинстве языков программирования строки являются неизменяемыми (immutable), то есть любая операция над строкой создаёт новую строку, не изменяя исходную.

**Символ** — минимальная единица строки. В Python отдельного типа `char` нет — символ представлен строкой длиной 1.

### Основные операции со строками (Python)

| Операция | Пример | Результат |
|---|---|---|
| Конкатенация | `"при" + "вет"` | `"привет"` |
| Повторение | `"ха" * 3` | `"хахаха"` |
| Длина строки | `len("слово")` | `5` |
| Срез (slice) | `"слово"[1:4]` | `"лов"` |
| Индексация | `"слово"[0]` | `"с"` |
| Поиск подстроки | `"слово".find("ло")` | `1` |
| Замена | `"слово".replace("с","б")` | `"блово"` |
| Разбиение | `"а б в".split()` | `["а","б","в"]` |
| Приведение к верхнему регистру | `"слово".upper()` | `"СЛОВО"` |
| Удаление пробелов | `"  ок  ".strip()` | `"ок"` |

---

## Задания

### Задание 1. Анализ символов строки

Напишите программу, которая принимает строку и выводит:

- общее количество символов,
- количество гласных букв (а, е, ё, и, о, у, ы, э, ю, я),
- количество согласных букв,
- количество пробелов,
- количество прочих символов (цифры, знаки препинания и т.д.).

**Пример входных данных:**
```
Введите строку: Компьютерная лингвистика 2024
```

**Пример выходных данных:**
```
Всего символов: 30
Гласных букв: 10
Согласных букв: 13
Пробелов: 2
Прочих символов: 5
```

**Шаблон кода:**
```python
def analyze_string(text):
    vowels = "аеёиоуыэюяАЕЁИОУЫЭЮЯ"
    consonants = "бвгджзйклмнпрстфхцчшщъьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЪЬ"
    
    total = len(text)
    v_count = 0
    c_count = 0
    space_count = 0
    other_count = 0
    
    for char in text:
        # TODO: заполнить логику подсчёта
        pass
    
    print(f"Всего символов: {total}")
    print(f"Гласных букв: {v_count}")
    print(f"Согласных букв: {c_count}")
    print(f"Пробелов: {space_count}")
    print(f"Прочих символов: {other_count}")

text = input("Введите строку: ")
analyze_string(text)
```

---

### Задание 2. Палиндром

Напишите программу, которая проверяет, является ли введённая строка палиндромом (читается одинаково слева направо и справа налево). Программа должна игнорировать регистр и пробелы.

**Примеры:**
```
"А роза упала на лапу Азора" → Палиндром
"Привет мир"                 → Не палиндром
```

**Указания:**
1. Удалите все пробелы из строки методом `replace()` или `join(split())`.
2. Приведите строку к нижнему регистру методом `lower()`.
3. Сравните строку с её обратной версией (`text[::-1]`).

**Шаблон кода:**
```python
def is_palindrome(text):
    # TODO: реализовать проверку
    pass

text = input("Введите строку: ")
if is_palindrome(text):
    print("Палиндром")
else:
    print("Не палиндром")
```

---

### Задание 3. Частотный анализ букв

Напишите программу, которая читает текст и выводит топ-5 самых часто встречающихся букв в порядке убывания их частоты. Регистр игнорируется.

**Пример выходных данных:**
```
Топ-5 букв:
1. 'о' — 12 раз
2. 'е' — 10 раз
3. 'а' — 9 раз
4. 'н' — 7 раз
5. 'и' — 6 раз
```

**Указания:**
- Используйте словарь (`dict`) или класс `Counter` из модуля `collections`.
- Отфильтруйте только буквы с помощью метода `isalpha()`.

**Шаблон кода:**
```python
from collections import Counter

def top_letters(text, n=5):
    text = text.lower()
    # TODO: подсчитать частоту букв и вывести топ-n
    pass

text = input("Введите текст: ")
top_letters(text)
```

---

### Задание 4. Шифр Цезаря

Реализуйте шифрование и дешифрование текста методом шифра Цезаря — каждая буква сдвигается на заданное количество позиций в алфавите.

**Пример (сдвиг 3):**
```
Исходный текст:   ПРИВЕТ
Зашифрованный:    ТУЛЕЗХ
```

**Требования:**
- Шифруйте только буквы, знаки препинания и пробелы оставляйте без изменений.
- Реализуйте отдельно для кириллицы (русский алфавит — 33 буквы).

**Шаблон кода:**
```python
def caesar_cipher(text, shift, decrypt=False):
    russian_lower = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
    russian_upper = russian_lower.upper()
    
    if decrypt:
        shift = -shift
    
    result = []
    for char in text:
        # TODO: реализовать сдвиг для кириллицы
        result.append(char)
    
    return "".join(result)

text = input("Введите текст: ")
shift = int(input("Введите сдвиг: "))
encrypted = caesar_cipher(text, shift)
print(f"Зашифровано: {encrypted}")
print(f"Расшифровано: {caesar_cipher(encrypted, shift, decrypt=True)}")
```

---

### Задание 5 (Повышенная сложность). Токенизация текста

Напишите программу-токенизатор, которая:

1. Принимает многострочный текст на русском языке.
2. Разбивает текст на токены (слова), удаляя знаки препинания.
3. Строит словарь уникальных слов с их частотой.
4. Выводит статистику: общее число токенов, число уникальных слов, самое длинное слово.

**Пример входных данных:**
```
Компьютерная лингвистика — раздел языкознания и информатики.
Она изучает язык с помощью математических и вычислительных методов.
```

**Пример выходных данных:**
```
Всего токенов: 16
Уникальных слов: 15
Самое длинное слово: "Компьютерная" (12 символов)

Частота слов:
  и — 2
  Компьютерная — 1
  ...
```

**Указания:**
- Для удаления пунктуации используйте модуль `string` (`string.punctuation`) или регулярные выражения (`re`).
- Приведите все слова к нижнему регистру для корректного подсчёта.

---

## Вопросы для самопроверки

1. Чем отличается метод `find()` от `index()` при поиске подстроки?
2. Что возвращает срез `s[::-1]`?
3. Почему строки в Python считаются неизменяемыми? Как это влияет на производительность при конкатенации?
4. В чём разница между `split()` и `split(' ')`?
5. Как можно проверить, состоит ли строка только из цифр?

---

## Критерии оценивания

| Баллы | Выполненные задания |
|---|---|
| 5 (отлично) | Задания 1–4 + Задание 5 с корректной обработкой краевых случаев |
| 4 (хорошо) | Задания 1–4 выполнены полностью |
| 3 (удовлетворительно) | Выполнено не менее 2 заданий из 4 основных |
| 2 (неудовлетворительно) | Менее 2 заданий или не сданная работа |

---

## Материалы для подготовки

- Официальная документация Python: [docs.python.org/3/library/stdtypes.html#string-methods](https://docs.python.org/3/library/stdtypes.html#string-methods)
- Модуль `collections.Counter`: [docs.python.org/3/library/collections.html](https://docs.python.org/3/library/collections.html)
- Введение в регулярные выражения (модуль `re`): [docs.python.org/3/library/re.html](https://docs.python.org/3/library/re.html)

---

*Практическая работа выполняется индивидуально. Результаты оформляются в виде файла `.py` с комментариями к каждому заданию и демонстрируются преподавателю.*
