# Практический урок: Создание переводного словаря на Python

**Предмет:** Технологии программирования  
**Специальность:** Компьютерная лингвистика  

## Цель работы

Научиться создавать и использовать словари (`dict`) в Python для хранения переводов слов, а также выполнять основные операции: добавление, поиск, обновление и удаление записей.

## Теоретическая часть

### Что такое словарь в Python?

Словарь (`dict`) — это структура данных, которая хранит пары **ключ: значение**. В контексте компьютерной лингвистики словарь удобен для хранения переводов: слово на одном языке является ключом, а его перевод — значением.

**Синтаксис создания словаря:**

```python
словарь = {ключ1: значение1, ключ2: значение2}
```

**Пример переводного словаря (английский → русский):**

```python
dictionary = {
    "cat": "кошка",
    "dog": "собака",
    "house": "дом",
    "tree": "дерево",
    "water": "вода"
}
```

### Основные операции со словарём

| Операция | Синтаксис | Пример |
|----------|-----------|--------|
| Создание | `d = {}` | `d = {"hello": "привет"}` |
| Добавление | `d[ключ] = значение` | `d["sun"] = "солнце"` |
| Получение значения | `d[ключ]` | `d["cat"]` → `"кошка"` |
| Безопасный поиск | `d.get(ключ)` | `d.get("bird", "не найдено")` |
| Удаление | `del d[ключ]` | `del d["cat"]` |
| Обновление | `d[ключ] = новое_значение` | `d["cat"] = "котик"` |
| Все ключи | `d.keys()` | возвращает все слова |
| Все значения | `d.values()` | возвращает все переводы |
| Проверка наличия | `ключ in d` | `"cat" in d` → `True` |

### Метод `.get()` vs обращение по ключу

Прямое обращение `d["слово"]` вызовет ошибку `KeyError`, если слово не найдено. Метод `.get()` возвращает `None` или указанное значение по умолчанию:

```python
# Небезопасно:
print(dictionary["bird"])  # KeyError: 'bird'

# Безопасно:
print(dictionary.get("bird", "Слово не найдено"))  # Слово не найдено
```

## Практическая часть

### Демонстрационный пример

Запустите и изучите следующий код:

```python
# Создание переводного словаря (английский → русский)
eng_rus = {
    "hello": "привет",
    "goodbye": "пока",
    "yes": "да",
    "no": "нет",
    "thank you": "спасибо"
}

# 1. Поиск перевода
word = "hello"
print(f"Перевод слова '{word}': {eng_rus[word]}")

# 2. Добавление нового слова
eng_rus["please"] = "пожалуйста"
print(f"Добавлено слово: 'please' → {eng_rus['please']}")

# 3. Проверка наличия слова
if "yes" in eng_rus:
    print(f"Слово 'yes' есть в словаре: {eng_rus['yes']}")

# 4. Безопасный поиск
result = eng_rus.get("sorry", "Слово не найдено")
print(f"Поиск 'sorry': {result}")

# 5. Вывод всего словаря
print("\nПолный словарь:")
for eng, rus in eng_rus.items():
    print(f"  {eng} → {rus}")

# 6. Удаление слова
del eng_rus["goodbye"]
print(f"\nПосле удаления 'goodbye', слов в словаре: {len(eng_rus)}")
```

**Ожидаемый вывод:**
```
Перевод слова 'hello': привет
Добавлено слово: 'please' → пожалуйста
Слово 'yes' есть в словаре: да
Поиск 'sorry': Слово не найдено

Полный словарь:
  hello → привет
  goodbye → пока
  yes → да
  no → нет
  thank you → спасибо
  please → пожалуйста

После удаления 'goodbye', слов в словаре: 5
```

## Самостоятельные задания

### Задание 1. Создание базового словаря

Создайте переводной словарь из **10 слов** на любую тему (например, животные, еда, цвета) на любой языковой паре по вашему выбору. Выведите все пары «слово → перевод» на экран с помощью цикла.

### Задание 2. Интерактивный поиск

Дополните словарь из Задания 1 программой, которая:
- запрашивает у пользователя слово с помощью `input()`,
- выводит его перевод, если слово есть в словаре,
- выводит сообщение `"Слово не найдено"`, если слова нет.

```python
# Пример структуры программы:
word = input("Введите слово для перевода: ").lower()
translation = my_dict.get(word, "Слово не найдено")
print(f"Перевод: {translation}")
```

### Задание 3. Управление словарём

Напишите программу, которая выполняет следующее:

1. Создаёт словарь с 5 словами.
2. Добавляет 3 новых слова.
3. Обновляет перевод одного из существующих слов.
4. Удаляет одно слово.
5. Выводит итоговый словарь и количество слов в нём.

### Задание 4 (дополнительное). Двуязычный словарь

Создайте **два связанных словаря**: один для перевода с языка A на язык B, второй — с языка B на язык A. Напишите функцию `translate(word, direction)`, где `direction` может принимать значения `"en-ru"` или `"ru-en"`, и возвращает перевод.

```python
def translate(word, direction):
    if direction == "en-ru":
        return en_to_ru.get(word, "Не найдено")
    elif direction == "ru-en":
        return ru_to_en.get(word, "Не найдено")
    else:
        return "Неверное направление перевода"
```

## Контрольные вопросы

1. Что такое словарь (`dict`) в Python? Чем он отличается от списка (`list`)?
2. Как создать пустой словарь и добавить в него несколько пар «ключ: значение»?
3. В чём разница между обращением `d["ключ"]` и методом `d.get("ключ")`? В каком случае лучше использовать `.get()`?
4. Как проверить, есть ли определённое слово в словаре, не вызывая ошибку?
5. Как удалить слово из словаря? Что произойдёт, если попытаться удалить слово, которого нет?
6. Каким методом можно перебрать все пары «ключ: значение» в словаре одновременно?
7. Могут ли значения в словаре повторяться? А ключи?
8. Почему структура `dict` удобна для задач компьютерной лингвистики? Приведите пример помимо переводного словаря.