# Практический урок: Обработка текста с использованием циклов

**Предмет:** Технологии программирования
**Специальность:** Компьютерная лингвистика
**Тип занятия:** Практический урок

## Цель урока

Научиться применять циклы `for` и `while` для обработки текстовых данных: перебора символов и слов, подсчёта элементов, фильтрации и преобразования строк.

## Теоретическая часть

### Цикл `for` для обработки строк

Строка в Python — это последовательность символов. Цикл `for` позволяет перебирать её посимвольно или поэлементно (например, по словам).

```python
text = "лингвистика"

# Перебор по символам
for char in text:
    print(char)
```

Если нужен индекс, используют `range(len(...))` или функцию `enumerate()`:

```python
text = "Python"

for i, char in enumerate(text):
    print(f"Индекс {i}: {char}")
```

### Цикл `while` для обработки текста

Цикл `while` удобен, когда нужно обрабатывать текст до достижения определённого условия.

```python
text = "обработка текста"
i = 0

while i < len(text):
    print(text[i])
    i += 1
```

### Перебор слов

Метод `.split()` разбивает строку на список слов. Затем по этому списку можно итерироваться:

```python
sentence = "компьютерная лингвистика это интересно"
words = sentence.split()

for word in words:
    print(word)
```

### Сравнительная таблица: `for` vs `while`

| Характеристика | `for` | `while` |
|---|---|---|
| Когда использовать | Количество итераций известно | Условие завершения неизвестно заранее |
| Перебор строки | `for char in text` | `while i < len(text)` |
| Простота | Короче и читаемее | Требует ручного управления счётчиком |
| Риск бесконечного цикла | Нет | Да, если не обновлять счётчик |

## Практические упражнения

### Упражнение 1. Подсчёт символов

Напишите программу, которая подсчитывает количество гласных букв в строке.

```python
text = "компьютерная лингвистика"
vowels = "аеёиоуыэюя"
count = 0

for char in text.lower():
    if char in vowels:
        count += 1

print(f"Количество гласных: {count}")
```

**Задание:** Измените программу так, чтобы она также подсчитывала согласные и выводила оба результата.

### Упражнение 2. Подсчёт слов заданной длины

Напишите программу, которая находит все слова длиной больше 5 символов.

```python
sentence = "Обработка текста является важной задачей лингвистики"
words = sentence.split()

for word in words:
    if len(word) > 5:
        print(word)
```

**Задание:** Измените условие — выводите только слова длиной ровно 6 символов.

### Упражнение 3. Инверсия строки с помощью цикла

Напишите программу, которая переворачивает строку посимвольно (без использования срезов).

```python
text = "лингвист"
result = ""

for char in text:
    result = char + result

print(result)  # тсивгнил
```

**Задание:** Перепишите ту же программу с использованием цикла `while`.

### Упражнение 4. Замена символов

Напишите программу, которая заменяет все пробелы в строке на символ подчёркивания `_`.

```python
text = "обработка текста на Python"
result = ""

for char in text:
    if char == " ":
        result += "_"
    else:
        result += char

print(result)
```

**Задание:** Измените программу так, чтобы она удаляла пробелы (не заменяла, а пропускала).

### Упражнение 5. Построение частотного словаря

Напишите программу, которая подсчитывает, сколько раз каждое слово встречается в тексте.

```python
text = "кот сидел кот лежал кот спал сидел"
words = text.split()
freq = {}

for word in words:
    if word in freq:
        freq[word] += 1
    else:
        freq[word] = 1

for word, count in freq.items():
    print(f"{word}: {count}")
```

**Задание:** Выведите только те слова, которые встречаются более одного раза.

## Самостоятельное задание

Напишите программу, которая принимает на вход произвольное предложение и выполняет следующее:

1. Подсчитывает общее количество символов (без пробелов).
2. Подсчитывает количество слов.
3. Выводит самое длинное слово в предложении.
4. Выводит каждое слово в обратном порядке символов (например, `"кот"` → `"ток"`).

Пример ввода:
```
Введите предложение: язык программирования Python очень удобен
```

Пример вывода:
```
Символов (без пробелов): 37
Слов: 5
Самое длинное слово: программирования
Слова в обратном порядке: кязя яинавориммаргорп nohtyP ьнечо небоду
```

## Контрольные вопросы

1. Чем отличается цикл `for` от цикла `while` при обработке строк?
2. Что возвращает метод `.split()` и как его результат используется в цикле?
3. Как с помощью `enumerate()` получить одновременно индекс и символ строки?
4. Что произойдёт, если в цикле `while` забыть увеличить счётчик `i`?
5. Как с помощью цикла построить новую строку, исключив из неё определённые символы?
6. Каким образом словарь `dict` помогает при подсчёте частоты слов в тексте?