# Лабораторная работа №7
## Лаборатория модуля NLP (Natural Language Processing) на языке Python

**Предмет:** Технологии программирования  
**Специальность:** Компьютерная лингвистика  


---

## Цель работы

Познакомиться с основными инструментами модуля обработки естественного языка (NLP) на языке Python, освоить базовые операции: токенизацию, лемматизацию, удаление стоп-слов и частеречную разметку.

---

## Теоретическая часть

**NLP (Natural Language Processing)** — раздел искусственного интеллекта, занимающийся обработкой и анализом текстов на естественном языке.

Основные задачи NLP:
- **Токенизация** — разбиение текста на отдельные единицы (токены): слова, предложения, символы.
- **Лемматизация** — приведение слова к его начальной (словарной) форме (лемме).
- **Стемминг** — отсечение окончаний и суффиксов для получения основы слова.
- **Удаление стоп-слов** — исключение часто встречающихся слов, не несущих смысловой нагрузки (предлоги, союзы и т.д.).
- **POS-теггинг (Part-of-Speech Tagging)** — определение части речи каждого слова в тексте.

### Используемые библиотеки

| Библиотека  | Описание                                          |
|-------------|---------------------------------------------------|
| `nltk`      | Классическая библиотека NLP для Python            |
| `spacy`     | Современная высокопроизводительная NLP-библиотека |
| `pymystem3` | Лемматизатор для русского языка (Яндекс Mystem)   |

---

## Практическая часть

### Задание 1. Установка библиотек и загрузка ресурсов

Откройте терминал или среду выполнения (Jupyter Notebook, VS Code) и выполните установку необходимых библиотек:

```bash
pip install nltk spacy pymystem3
python -m spacy download ru_core_news_sm
```

Затем в Python-скрипте загрузите ресурсы NLTK:

```python
import nltk
nltk.download('punkt')
nltk.download('stopwords')
nltk.download('averaged_perceptron_tagger')
```

---

### Задание 2. Токенизация текста

Напишите программу, которая выполняет токенизацию на уровне слов и предложений.

```python
from nltk.tokenize import word_tokenize, sent_tokenize

text = ("Обработка естественного языка — увлекательная область. "
        "Она объединяет лингвистику и программирование. "
        "Сегодня мы изучаем токенизацию.")

# Токенизация по предложениям
sentences = sent_tokenize(text, language='russian')
print("Предложения:")
for i, sent in enumerate(sentences, 1):
    print(f"  {i}: {sent}")

# Токенизация по словам
words = word_tokenize(text, language='russian')
print("\nСлова:")
print(words)
```

**Ожидаемый вывод:**
```
Предложения:
  1: Обработка естественного языка — увлекательная область.
  2: Она объединяет лингвистику и программирование.
  3: Сегодня мы изучаем токенизацию.

Слова:
['Обработка', 'естественного', 'языка', '—', 'увлекательная', ...]
```

---

### Задание 3. Удаление стоп-слов

Напишите программу, которая фильтрует стоп-слова из токенизированного текста.

```python
from nltk.tokenize import word_tokenize
from nltk.corpus import stopwords

text = "Это простой пример того как работает удаление стоп слов в тексте"

# Загрузка стоп-слов для русского языка
stop_words = set(stopwords.words('russian'))

tokens = word_tokenize(text.lower(), language='russian')

filtered = [word for word in tokens if word.isalpha() and word not in stop_words]

print("Исходные токены:", tokens)
print("После удаления стоп-слов:", filtered)
print(f"\nУдалено стоп-слов: {len(tokens) - len(filtered)}")
```

---

### Задание 4. Лемматизация с pymystem3

Напишите программу, которая приводит русские слова к начальной форме.

```python
from pymystem3 import Mystem

mystem = Mystem()

text = "Студенты изучают программирование и создают интересные проекты"

lemmas = mystem.lemmatize(text)
result = [lemma.strip() for lemma in lemmas if lemma.strip()]

print("Исходный текст:", text)
print("Леммы:", result)
```

**Ожидаемый вывод:**
```
Исходный текст: Студенты изучают программирование и создают интересные проекты
Леммы: ['студент', 'изучать', 'программирование', 'и', 'создавать', 'интересный', 'проект']
```

---

### Задание 5. POS-теггинг с spaCy

Напишите программу, определяющую части речи каждого слова в предложении.

```python
import spacy

# Загрузка русской языковой модели
nlp = spacy.load("ru_core_news_sm")

text = "Лингвист анализирует сложный текст в исследовательской лаборатории."

doc = nlp(text)

print(f"{'Слово':<20} {'Лемма':<20} {'Часть речи':<15} {'Тег'}")
print("-" * 65)
for token in doc:
    print(f"{token.text:<20} {token.lemma_:<20} {token.pos_:<15} {token.tag_}")
```

**Ожидаемый вывод:**

```
Слово                Лемма                Часть речи      Тег
-----------------------------------------------------------------
Лингвист             лингвист             NOUN            NN
анализирует          анализировать        VERB            VBC
сложный              сложный              ADJ             Afpmsnn
текст                текст                NOUN            NN
...
```

---

### Задание 6. Комплексный анализ текста

Объедините все изученные техники в одной программе.

```python
import spacy
from nltk.corpus import stopwords
from pymystem3 import Mystem

nlp = spacy.load("ru_core_news_sm")
mystem = Mystem()
stop_words = set(stopwords.words('russian'))

def analyse_text(text: str):
    print("=" * 60)
    print("ИСХОДНЫЙ ТЕКСТ:")
    print(text)
    print("=" * 60)

    # Токенизация и POS с spaCy
    doc = nlp(text)
    tokens = [token.text for token in doc if not token.is_punct]
    print(f"\nКоличество токенов (без пунктуации): {len(tokens)}")

    # Удаление стоп-слов
    filtered = [t for t in tokens if t.lower() not in stop_words]
    print(f"После удаления стоп-слов: {len(filtered)} слов")
    print("Ключевые слова:", filtered)

    # Лемматизация
    lemmas_raw = mystem.lemmatize(" ".join(filtered))
    lemmas = [l.strip() for l in lemmas_raw if l.strip()]
    print("\nЛеммы ключевых слов:", lemmas)

    # Частеречная статистика
    pos_counts = {}
    for token in doc:
        if not token.is_punct and not token.is_space:
            pos_counts[token.pos_] = pos_counts.get(token.pos_, 0) + 1

    print("\nСтатистика по частям речи:")
    for pos, count in sorted(pos_counts.items(), key=lambda x: -x[1]):
        print(f"  {pos}: {count}")

# Запуск анализа
sample = ("Компьютерная лингвистика изучает методы автоматической обработки "
          "текстов и разрабатывает алгоритмы для анализа языковых данных.")
analyse_text(sample)
```

---

## Контрольные вопросы

1. Что такое токенизация и чем отличается токенизация по словам от токенизации по предложениям?
2. В чём разница между лемматизацией и стеммингом? Приведите примеры.
3. Для чего применяется удаление стоп-слов в NLP-задачах?
4. Что такое POS-теггинг? Какие метки частей речи вы встретили в ходе выполнения работы?
5. Какие языковые модели spaCy поддерживают русский язык?
6. В каких практических приложениях используются описанные методы NLP?

---

## Индивидуальное задание

Используя все изученные методы, выполните анализ предложенного текста (объём — не менее 5 предложений на русском языке):

1. Проведите токенизацию на уровне слов и предложений.
2. Удалите стоп-слова и выведите список ключевых слов.
3. Выполните лемматизацию ключевых слов.
4. Определите части речи для каждого токена.
5. Постройте частотный словарь лемм и выведите топ-5 наиболее встречающихся.
6. Оформите результаты в виде отчёта с выводами.

---

## Требования к отчёту

- Название работы, цель, ФИО, группа, дата.
- Листинги всех написанных программ с комментариями.
- Скриншоты результатов выполнения каждого задания.
- Ответы на контрольные вопросы.
- Вывод по работе.
