# Лабораторная работа №7
## Тема: Подсчёт символов и слов в тексте

**Предмет:** Технологии программирования  
**Специальность:** Компьютерная лингвистика  


---

## Цель работы

Научиться считывать текстовые данные и выполнять базовый анализ текста: подсчёт символов, слов, строк и других текстовых единиц с помощью встроенных инструментов Python.

---

## Теоретическая часть

### Что такое подсчёт символов и слов?

В компьютерной лингвистике первичный анализ текста часто начинается с простых количественных характеристик:

| Единица         | Описание                                                    | Пример              |
|-----------------|-------------------------------------------------------------|---------------------|
| **Символ**      | Один знак: буква, цифра, пробел, знак препинания            | `'а'`, `' '`, `'!'` |
| **Слово**       | Последовательность символов, ограниченная пробелами         | `'кот'`, `'бежит'`  |
| **Строка**      | Последовательность символов до символа переноса `\n`        | `'Привет мир'`      |
| **Предложение** | Последовательность слов, оканчивающаяся на `.`, `!` или `?` | `'Кот бежит.'`      |

---

### Основные методы Python для работы с текстом

#### 1. `len()` — длина строки (количество символов)

```python
text = "Привет, мир!"
print(len(text))  # 12 — считает все символы, включая пробелы и знаки
```

#### 2. `split()` — разбивка на слова

```python
text = "Кот сидит на окне"
words = text.split()       # по пробелам (по умолчанию)
print(words)               # ['Кот', 'сидит', 'на', 'окне']
print(len(words))          # 4
```

#### 3. `splitlines()` — разбивка на строки

```python
text = "Первая строка\nВторая строка\nТретья строка"
lines = text.splitlines()
print(len(lines))  # 3
```

#### 4. `count()` — подсчёт вхождений подстроки

```python
text = "банан"
print(text.count('а'))  # 3
```

#### 5. Метод `strip()` — удаление лишних пробелов

```python
text = "  Привет мир  "
print(text.strip())       # 'Привет мир'
```

---

### Таблица сравнения методов подсчёта

| Задача            | Метод                    | Пример                                |
|-------------------|--------------------------|---------------------------------------|
| Все символы       | `len(text)`              | `len("Привет")` → `6`                 |
| Только буквы      | цикл + `isalpha()`       | `sum(1 for c in text if c.isalpha())` |
| Только цифры      | цикл + `isdigit()`       | `sum(1 for c in text if c.isdigit())` |
| Количество слов   | `len(text.split())`      | `len("раз два три".split())` → `3`    |
| Количество строк  | `len(text.splitlines())` | `len("а\nб\nв".splitlines())` → `3`   |
| Вхождения символа | `text.count(символ)`     | `"банан".count('а')` → `3`            |

---

## Практические задания

### Задание 1. Базовый анализ строки

Напишите программу, которая принимает строку от пользователя и выводит:
- общее количество символов (с пробелами и без);
- количество слов;
- количество букв, цифр и знаков препинания.

```python
import string

text = input("Введите строку: ")

# Общий подсчёт символов
total = len(text)
no_spaces = len(text.replace(" ", ""))

# Подсчёт слов
words = text.split()
word_count = len(words)

# Подсчёт букв, цифр и знаков препинания
letters = sum(1 for c in text if c.isalpha())
digits  = sum(1 for c in text if c.isdigit())
punct   = sum(1 for c in text if c in string.punctuation)

print(f"\nАнализ текста:")
print(f"  Символов всего:          {total}")
print(f"  Символов без пробелов:   {no_spaces}")
print(f"  Слов:                    {word_count}")
print(f"  Букв:                    {letters}")
print(f"  Цифр:                    {digits}")
print(f"  Знаков препинания:       {punct}")
```

**Пример работы программы:**
```
Введите строку: Привет, мир! 2025 год.

Анализ текста:
  Символов всего:          21
  Символов без пробелов:   18
  Слов:                    4
  Букв:                    13
  Цифр:                    4
  Знаков препинания:       3
```

---

### Задание 2. Анализ многострочного текста

Напишите программу, которая анализирует текст из нескольких строк (ввод завершается пустой строкой).

```python
print("Введите текст (пустая строка — конец ввода):")

lines = []
while True:
    line = input()
    if line == "":
        break
    lines.append(line)

# Объединяем строки в один текст
full_text = "\n".join(lines)

line_count = len(lines)
word_count = len(full_text.split())
char_count = len(full_text)

print(f"\nРезультат:")
print(f"  Строк:    {line_count}")
print(f"  Слов:     {word_count}")
print(f"  Символов: {char_count}")
```

---

### Задание 3. Частота символов

Напишите программу, которая выводит, сколько раз каждая буква встречается в тексте (без учёта регистра).

```python
text = input("Введите текст: ").lower()

# Считаем только буквы
frequency = {}
for char in text:
    if char.isalpha():
        frequency[char] = frequency.get(char, 0) + 1

# Сортируем по убыванию частоты
sorted_freq = sorted(frequency.items(), key=lambda x: x[1], reverse=True)

print("\nЧастота букв:")
for char, count in sorted_freq:
    print(f"  '{char}': {count}")
```

**Пример работы:**
```
Введите текст: Мама мыла раму

Частота букв:
  'м': 4
  'а': 3
  'л': 1
  'ы': 1
  'р': 1
  'у': 1
```

---

### Задание 4. Подсчёт предложений

Напишите программу, которая считает количество предложений в тексте.

```python
import re

text = input("Введите текст: ")

# Предложение заканчивается на . ! или ?
sentences = re.split(r'[.!?]+', text)

# Убираем пустые элементы
sentences = [s.strip() for s in sentences if s.strip()]

print(f"Количество предложений: {len(sentences)}")
```

---

## Самостоятельное задание

Напишите программу **«Полный анализатор текста»**, которая:

1. Считывает текст из нескольких строк (завершение — пустая строка).
2. Выводит следующие характеристики:
   - количество символов (всего, без пробелов, только буквы);
   - количество слов;
   - количество предложений;
   - количество строк;
   - самое длинное слово;
   - самое короткое слово;
   - среднюю длину слова (округлить до 2 знаков).
3. Оформить вывод в виде аккуратной таблицы.

**Пример вывода:**
```
╔══════════════════════════════════╗
║       АНАЛИЗ ТЕКСТА              ║
╠══════════════════════════════════╣
║ Символов (всего):        45      ║
║ Символов (без пробелов): 38      ║
║ Только букв:             32      ║
║ Слов:                    8       ║
║ Предложений:             2       ║
║ Строк:                   3       ║
║ Самое длинное слово: лингвистика ║
║ Самое короткое слово:    я       ║
║ Средняя длина слова:     4.00    ║
╚══════════════════════════════════╝
```

---

## Контрольные вопросы

1. Чем отличается `len(text)` от `len(text.split())`?
2. Что возвращает метод `split()` без аргументов и что происходит с множественными пробелами?
3. Как с помощью метода `count()` посчитать количество вхождений подстроки?
4. Какой метод используется для разбивки текста на строки?
5. Как с помощью `isalpha()`, `isdigit()` и `isspace()` отфильтровать нужные символы?
6. Чем отличаются методы `strip()`, `lstrip()` и `rstrip()`?

